/*
React로 만든 웹서비스들은
보통 React App, React Application 이라고 불리움

리엑트로 만들어진 대다수의 웹 서비스들은 단순한 웹 페이지의 기능을 넘어서 이런
넷플릭스나 페이스북 또는 인스타그램 처럼 사실상 어플리케이션에 가까울 정도로 매우 다양한 

기능들을 제공하고 있기 때문에 이건 마치 단순한 웹이 아니라 웹 브라우저 위에서 동작하는 앱플리케이션 같다 해서

보통 리엑트 App, 리엑트 에플리케이션 이라고 부르게 된다.


*/

// React 또한 NPM에 등록된 자바스크립트의 라이브러리 이다.

/*

1. Node.js 패키지 생성

2. React 라이브러리 설치

3. 기타 도구 설치 및 설정
  -> 기타 도구들을 직접 설치하고 설정하는게 상당히 복잡하고 까다롭다.

그래서 vite를 사용한다. (차세대 프론트엔드 개발 툴)

기본 설정이 미리 다 완료된 사태의 그런 리액트 앱을 한 방에 생성하도록 하자.

React에서 Vite은 공식문서에서도 권장 되괴 있다.

그렇기 때문에 오늘날  대부분의 React App은 vite를 이용해서 만들어 진다고 생각해도 된다.


*/